Repository: jscholes/nvda-speech-history
Catalog: speechHistory/locale/*/LC_MESSAGES/nvda.po
Languages: ru, uk

source: Copied
ru: Сообщение NVDA скопировано
uk: Скопійовано

source: Copy the currently selected speech history item to the clipboard, which by default will be the most recently spoken text by NVDA.
ru: Копирование выбранного элемента истории речи в буфер обмена, по умолчанию это последняя произнесённая фраза NVDA.
uk: Скопіювати вибраний елемент історії мовлення в буфер обміну, який за замовчуванням буде останнім текстом, прочитаним NVDA.

source: Review the previous item in NVDA's speech history.
ru: Просмотр предыдущего сообщение в истории речи NVDA.
uk: Переглянути попередній елемент в історії мовлення NVDA.

source: Review the next item in NVDA's speech history.
ru: Просмотр следующего сообщение в истории речи NVDA.
uk: Переглянути наступний елемент в історії мовлення NVDA.

source: Already recording speech
ru: Запись речи уже идёт
uk: Мовлення записується

source: Started recording speech
ru: Запись речи начата
uk: Запис мовлення розпочато

source: Start recording NVDA's speech output, for copying multiple announcements to the clipboard.
ru: Начинает записывать речевой вывод NVDA для копирования нескольких объявлений в буфер обмена.
uk: Почати записувати голосовий вивід NVDA, щоб скопіювати кілька оголошень до буфера обміну.

source: Not currently recording speech
ru: В данный момент речь не записывается
uk: Наразі мовлення не записується

source: Recorded speech copied to clipboard
ru: Записанная речь скопирована в буфер обмена
uk: Записане мовлення скопійовано в буфер обміну

source: Stop recording NVDA's speech output, and copy the recorded announcements to the clipboard.
ru: Останавливает запись речевого вывода NVDA и копирует записанные объявления в буфер обмена.
uk: Зупинити запис мовлення NVDA та скопіюйте записані оголошення до буфера обміну.

source: Viewing speech history is not supported in this version of NVDA for security reasons.
ru: По соображениям безопасности просмотр истории речевых сообщений в этой версии NVDA не поддерживается.
uk: Перегляд історії мовлення не підтримується в цій версії NVDA з міркувань безпеки.

source: No history items.
ru: Нет сообщений в истории речи.
uk: Немає елементів історії

source: Speech History
ru: История речи
uk: Історія мовлення

source: Show NVDA's speech history in a browseable list
ru: Показать историю речи NVDA в виде списка
uk: Показати історію мовлення NVDA у вигляді списку, який можна переглядати

source: &Maximum number of history entries (requires NVDA restart to take effect)
ru: &Максимальное количество записей истории (для вступления в силу требуется перезапуск NVDA)
uk: &Максимальна кількість записів в історії (потрібен перезапуск для застосування)

source: &After copying speech:
ru: &Действие после копирования речи:
uk: &Після копіювання мовлення:

source: Do nothing
ru: Действие не требуется
uk: Нічого не робити

source: Beep
ru: Воспроизводить звуковой сигнал
uk: Звуковий сигнал

source: Speak
ru: Проговаривать
uk: Мовлення

source: Both beep and speak
ru: Проговаривать и воспроизводить звуковой сигнал
uk: Звуковий сигнал та мовлення

source: Beep &frequency (Hz)
ru: &Частота звукового сигнала (в герцах)
uk: &Частота звукового сигналу (Гц)

source: Beep &duration (ms)
ru: &Длительность звукового сигнала (в милисекундах)
uk: Тривалість звукового сигналу (мс)

source: &Play example beep
ru: &Воспроизвести образец звукового сигнала
uk: &Відтворити приклад звукового сигналу

source: Trim whitespace from &start when copying text
ru: &Обрезать пробелы с начала при копировании текста
uk: Видалити пробіли на початку під час копіювання тексту

source: Trim whitespace from &end when copying text
ru: &Обрезать пробелы с конца при копировании текста
uk: Видалити пробіли у кінці під час копіювання тексту
